#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation. 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dailydesk/Production-CD/runs/run-HWahsSBhwPXNzyLg

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
heroku_app.app: Refreshing state... [id=9cd928bd-6be1-4e21-a90c-80832ed2966b]
heroku_formation.machine_config: Refreshing state... [id=6ec75707-9bc9-438b-9be6-4e7b01938f61]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # heroku_addon.database will be created
  + resource "heroku_addon" "database" {
      + app_id            = "9cd928bd-6be1-4e21-a90c-80832ed2966b"
      + config            = {
          + "sslmode" = "false"
        }
      + config_var_values = (sensitive value)
      + config_vars       = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + plan              = "heroku-postgresql:hobby-dev"
      + provider_id       = (known after apply)
    }

  # heroku_formation.machine_config will be updated in-place
  ~ resource "heroku_formation" "machine_config" {
        id       = "6ec75707-9bc9-438b-9be6-4e7b01938f61"
      ~ size     = "Basic" -> "Hobby"
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```
</details>
*Pushed by: @KiranGopalakrishnan, Action: `pull_request`*